<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python49_csv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**파일에서 데이터를 읽고 DataFrame 만들기**

# pd.read_csv()

In [1]:
import pandas as pd

In [3]:
file_path = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex1.csv'
ex1_df = pd.read_csv(file_path)
ex1_df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
type(ex1_df)

pandas.core.frame.DataFrame

In [5]:
ex1_df.shape

(3, 5)

In [6]:
ex1_df.columns

Index(['a', 'b', 'c', 'd', 'message'], dtype='object')

In [7]:
ex1_df.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
ex1_df.dtypes  # 각 컬럼의 데이터 타입을 pandas.Series로 리턴.
# dtype = object는 문자열

a           int64
b           int64
c           int64
d           int64
message    object
dtype: object

In [10]:
# 데이터 프레임의 변수(컬럼)의 데이터 타입을 변경
ex1_df['a'] = ex1_df['a'].astype('float')
ex1_df.dtypes

a          float64
b            int64
c            int64
d            int64
message     object
dtype: object

In [11]:
ex1_df

     a   b   c   d message
0  1.0   2   3   4   hello
1  5.0   6   7   8   world
2  9.0  10  11  12     foo

# pd.read_excel()

In [13]:
file_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex1.xlsx'
ex1_df = pd.read_excel(file_path, index_col=0)
ex1_df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# pd.read_csv() 파라미터들

In [16]:
# csv 파일에 헤더 정보(컬럼 이름들)가 없을 때
file_path = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex2.csv'
df = pd.read_csv(file_path, 
                 header=None,  # CSV 파일에 헤더(컬럼 이름)이 포함되어 있지 않음.
                 names=['c1', 'c2', 'c3', 'c4', 'msg']  # DF의 컬럼 이름들을 지정.
                 )
df

   c1  c2  c3  c4    msg
0   1   2   3   4  hello
1   5   6   7   8  world
2   9  10  11  12    foo

In [18]:
# pd.read_csv() 함수는 *.csv, *.txt, *.tsv 확장자들을 모두 사용할 수 있음.
# csv 파일에서 데이터의 구분자(separator)가 comma(,)가 아닌 경우:
# \t: 탭(tab), \s: 공백(space)
# 정규 표현식(regular expression) 문자열: r'reg_expr'

file_path = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex3.txt'
df = pd.read_csv(file_path, sep=r'\s+')
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [19]:
df.shape
# 컬럼 이름이 지정되지 않은 values들은 자동으로 데이터 프레임의 (row) index로 만들어줌.

(4, 3)

In [20]:
# df에서 인덱스 'aaa'인 row 선택
df.iloc[0]

A   -0.264438
B   -1.026059
C   -0.619500
Name: aaa, dtype: float64

In [21]:
df.loc['aaa']

A   -0.264438
B   -1.026059
C   -0.619500
Name: aaa, dtype: float64

In [22]:
df.loc[['aaa', 'bbb']]

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399

In [23]:
df.loc[['aaa', 'bbb'], ['A', 'B']]

            A         B
aaa -0.264438 -1.026059
bbb  0.927272  0.302904

In [25]:
# csv 파일이 헤더/데이터와 데이터가 아닌 주석(#으로 시작하는 라인)을 포함하는 경우:
# 데이터가 아닌 라인 번호(0부터 시작!)를 생략(skip)하고 데이터를 읽음.

file_path = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex4.csv'
df = pd.read_csv(file_path, skiprows=(0, 2, 3))
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
# csv 파일에 'NA', empty value 등이 포함된 경우:

file_path = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex5.csv'
df = pd.read_csv(file_path)
df
# NaN: Not a Number, NA: Not Available -> 값이 없음. 누락치.

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
df.describe()

         a     b          c     d
count  3.0   3.0   2.000000   3.0
mean   5.0   6.0   7.000000   8.0
std    4.0   4.0   5.656854   4.0
min    1.0   2.0   3.000000   4.0
25%    3.0   4.0   5.000000   6.0
50%    5.0   6.0   7.000000   8.0
75%    7.0   8.0   9.000000  10.0
max    9.0  10.0  11.000000  12.0

In [28]:
df['message'].value_counts()

world    1
foo      1
Name: message, dtype: int64

In [33]:
# csv 파일이 너무 긴 경우(row가 많은 경우):
# 일부 rows만 읽고, 데이터 프레임의 구조만 확인하고 싶은 경우

file_path = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex6.csv'
df = pd.read_csv(file_path, nrows=5)
df

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [34]:
df = pd.read_csv(file_path)
df.shape

(10000, 5)

In [35]:
# csv 파일의 value들이 따옴표("")로 묶여 있는 경우:

file_path = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex7.csv'
df = pd.read_csv(file_path)
df

   a  b  c
0  1  2  3
1  1  2  3

In [36]:
df.dtypes
# "" 안에 있는 값들이 모두 숫자로 변환 가능한 경우에는 pandas가 자동으로 타입 변환 수행!

a    int64
b    int64
c    int64
dtype: object

## DataFrame.write_csv()

In [5]:
file_path = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex5.csv'
df = pd.read_csv(file_path, index_col='something')  # read_csv() 함수
df

           a   b     c   d message
something
one        1   2   3.0   4     NaN
two        5   6   NaN   8   world
three      9  10  11.0  12     foo

In [3]:
df.shape

(3, 5)

In [6]:
df.dtypes
# pandas.read_csv() 함수는 컬럼에 누락값(NA)이 있는 경우, 숫자들이 있는 컬럼은 float 타입으로 취급.

a            int64
b            int64
c          float64
d            int64
message     object
dtype: object

In [8]:
df.to_csv('ex05_out.csv')  # DataFrame.to_csv() 메서드
# 누락값(NA, NaN, na, nan)은 비어 있는 값(,,)으로 파일에 write됨.

In [9]:
# csv 파일을 write할 때 헤더 정보(column 또는 row 이름)를 제외하고 싶으면,
df.to_csv('ex05_without_header.csv', header=False)

In [12]:
# csv 파일을 write할 때 DataFrame이 가지고 있는 헤더 정보 대신에 다른 이름들을 사용하고 싶으면,
df.to_csv('ex05_new_header.csv', 
          header=['A', 'B', 'C', 'D', 'MSG'],  # 컬럼 이름들을 변경할 때
          index_label='ORDER'  # row index (컬럼)의 이름을 변경할 때
          )

In [13]:
# (row) 인덱스를 제외하고 csv 파일을 write할 때
df.to_csv('ex05_without_index.csv', index=False)